backend/controllers/PostController.php

INSERT INTO `post` (`title`, `content`, `tags`, `status`, `author_id`, `create_time`, `update_time`) VALUES ('测试缓存依赖', '1', '123', 2, 1, 1493343842, 1493343842)
---
    public function actionCreate()
    {
        if(!Yii::$app->user->can('createPost'))
            throw new ForbiddenHttpException('抱歉,您无权访问.');
        $model = new Post();
        //更新时间
        //$model->update_time = time();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

UPDATE `post` SET `status`=2, `update_time`=1493351306, `author_id`=1 WHERE `id`=48
---
    public function actionUpdate($id)
    {
        if(!Yii::$app->user->can('updatePost'))
            throw new ForbiddenHttpException('抱歉,您无权访问.');
        $model = $this->findModel($id);
        //更新时间
        //$model->update_time = time();
        //$model->create_time = time();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {