frontend/controllers/PostController.php

    public function actionDetail($id)
    {
        //step1:准备数据模型
        $model = $this->findModel($id);
        $tags = Tag::findTagWeights();
        $recentComments = Comment::findRecentComments();
        $commentModel = new Comment();
        //当前用户信息
        if ($userMe = User::findOne(Yii::$app->user->id))
---
SELECT * FROM `user` WHERE `id` IS NULL