backend/views/post/_form.php

SELECT `name`, `id` FROM `poststatus` ORDER BY `position`
---
    			->column();
    */
    ?>
    <?= $form->field($model, 'status')
    ->dropDownList(Poststatus::find()
	    			->select(['name','id'])
	    			->orderby('position')
	    			->indexby('id')
	    			->column(),
	    			['prompt'=>'请选择']); ?>