backend/views/post/index.php

SELECT `name`, `id` FROM `poststatus`
---
           //status',
            ['attribute'=>'status',
             'value'=>'status0.name',
             'filter'=>Poststatus::find()
                     ->select(['name','id'])