backend/views/comment/index.php

SELECT `name`, `id` FROM `commentstatus`
---
            [
                'attribute'=>'status',
                'value'=>'status0.name',
                'filter'=>Commentstatus::find()
                        ->select(['name','id'])