common/models/Adminuser.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);
---
SELECT * FROM `adminuser` WHERE `id`=1

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);
---
SELECT * FROM `adminuser` WHERE `username`='weixi'