common/models/Comment.php

    public static function getPendingCommentCount()
    {
        return Comment::find()->where(['status'=>1])->count();
---
SELECT COUNT(*) FROM `comment` WHERE `status`=1

    public static function findRecentComments($limit = 10)
    {
        return Comment::find()
            ->where(['status'=>2])
            ->orderBy(['create_time'=>SORT_DESC])
            ->limit($limit)
            ->all();
---
SELECT * FROM `comment` WHERE `status`=2 ORDER BY `create_time` DESC LIMIT 10