common/models/Post.php

    public function getCommentCount()
    {
        return Comment::find()->where(['post_id'=>$this->id,'status'=>2])->count();
---
SELECT COUNT(*) FROM `comment` WHERE (`post_id`=49) AND (`status`=2)