common/models/Tag.php

    public static function addTags($tags)
    {
    	if(empty($tags)) return ;

    	foreach ($tags as $name)
    	{
    		$aTag = Tag::find()->where(['name'=>$name])->one();
    		$aTagCount = Tag::find()->where(['name'=>$name])->count();

    		if(!$aTagCount)
    		{
    			$tag = new Tag();
    			$tag->name = $name;
    			$tag->frequency = 1;
    			$tag->save();
    		}
    		else
    		{
    			$aTag->frequency += 1;
    			$aTag->save();
---
SELECT * FROM `tag` WHERE `name`='123'
SELECT COUNT(*) FROM `tag` WHERE `name`='123'
INSERT INTO `tag` (`name`, `frequency`) VALUES ('1', 1)
UPDATE `tag` SET `frequency`=2 WHERE `id`=76

	public static function findTagWeights($limit=20)
	{
		//将标签分为5个级别
		$tag_size_level = 5;

		//根据频率取出前20个标签
		$models=Tag::find()->orderBy('frequency desc')->limit($limit)->all();
		$total=Tag::find()->limit($limit)->count();
---
SELECT * FROM `tag` ORDER BY `frequency` DESC LIMIT 20
SELECT COUNT(*) FROM `tag`