frontend/views/post/detail.php

                        <span class="glyphicon glyphicon-user" aria-hidden="true"></span>
                        <em><?= Html::encode($commentModel->user->username);?></em>
                    </div>
                <?php } elseif($added === 0 && !User::findOne(Yii::$app->user->id)){?>
---
SELECT * FROM `user` WHERE `id` IS NULL

                <ul class="list-group">
                    <li class="list-group-item">
                        <span class="glyphicon glyphicon-search" aria-hidden="true"></span>查找文章
                        (<?=Post::find()->count()?>)
---
SELECT COUNT(*) FROM `post`