frontend/views/post/index.php

SELECT COUNT(*) FROM `post`
---
                        {
                            $dependency = new DbDependency(
                                ['sql'=>'SELECT COUNT(id) FROM post']);
                            $data = Post::find()->count(); sleep(5);